linux.org
#+TITLE: Linux
#+OPTIONS: num:nil
#+SETUPFILE: /home/silin/.emacs.d/org-html-themes/org/theme-bigblow.setup
#+startup: content

* Install 
** 系统盘恢复
#+BEGIN_SRC 
1. WIN+R diskpart
2. select disk (Disk)
3. clean
4. new add 
#+END_SRC
** 写入系统

1. 下载ubuntu 
2. 下载USBwriter并安装
3. 写入系

** 安装
#+BEGIN_SRC
my computer : F12
#+END_SRC
** Update nvidia drivers for linux
#+BEGIN_SRC 
sudo add-apt-repository ppa:graphics-drivers/ppa
sudo apt update 
ubuntu-drivers devices
sudo apt-get --reinstall install nvidia-430
    1.  will be asked for password
    2.  reboot
    3.  select Enroll MOK -> continue -> Yes -> Roboot
nvidia-sim
watch -n 1 nvidia-smi
#+END_SRC

** chinese 
export LC_CTYPE=zh_CN.UTF-8
sudo apt-get -y install language-pack-zh-hans
此应用压制中英文的同步变化, 尽量避免使用中文
* System configuration collection
** open fire wall  for port
  add port :
  sudo firewall-cmd --add-port=80/tcp --permanent
  restart firewall:
  sudo  firewall-cmd --reload
  check port:
  sudo  firewall-cmd --list-all

** Shutdown Keyboard default
#+BEGIN_SRC 

1. $ xinput list 
   Find the Touchpad and its NAME and ID
2. $ xinput set-prop 'NAME' 'Device Enabled' 0
   to close the Touchpad
3. but with following can be named as tpOn and tpOff in ./bashrc
alias tpOff="xinput set-prop 'SYNA1D31:00 06CB:CD48 Touchpad' 'Device Enabled' 0"
alias tpOn="xinput set-prop 'SYNA1D31:00 06CB:CD48 Touchpad' 'Device Enabled' 1"
4. Close Touchpad default in boost system
   the following in ~/.config/autostart/xinput.desktop
#+END_SRC

#+BEGIN_SRC 
[Desktop Entry]
Type=Application
Exec=xinput set-prop 'SYNA1D31:00 06CB:CD48 Touchpad' 'Device Enabled' 0
Hidden=false
NoDisplay=false
X-GNOME-Autostart-enabled=true
Name[zh_CN]=touchpad enable
Name=touchpad enable
#+END_SRC
** autostart
Thunderbird
#+begin_src 
[Desktop Entry]
Type=Application
Exec=/usr/bin/thunderbird
Hidden=false
NoDisplay=false
X-GNOME-Autostart-enabled=true
Name[en_US]=thunderbird
Name=thunderbird
Comment[en_US]=thunderbird
Comment=thunderbird

#+end_src
** exchange Control Key and Caps Key

在/etc/default/keyboard文件中添加:
#+BEGIN_SRC 
XKBOPTIONS="ctrl:nocaps
#+END_SRC
or
#+BEGIN_SRC shell
setxkbmap -option ctrl:nocaps
#+END_SRC
setting for 右键没反应
$ sudo add-apt-repository universe
$ sudo apt install gnome-tweak-tool

** right key no response
#+BEGIN_SRC 
gsettings set org.gnome.desktop.peripherals.touchpad click-method areas
#+END_SRC

** hotkey

| C-M- t | terminal             |
| C-M- p | thunderbird          |
| C-M- e | emacs                |
| C-M- f | firefox              |
| C-M- j | emacs windows switch |
| C-M- t | terminal             |
| C-M- w | emacs worterbuch     |
| C-M- t | terminal             |
| C-M- t | terminal             |
|        |                      |



|---------------------------------+-----------|
| Switch application              | Alt + Tab |
| Switch window of an application | Alt + Spc |
|                                 |           |
|---------------------------------+-----------|

|--------------+----------|
| Alt Ctrl Del | 退出用户 |

in Einstellung, the executable command can be used in command for customized hotkey

