linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-03 Do 17:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="silin" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Linux</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9d12c48">Install</a>
<ul>
<li><a href="#orge82f6fe">系统盘恢复</a></li>
<li><a href="#orga612b6a">写入系统</a></li>
<li><a href="#org1338a59">安装</a></li>
<li><a href="#orgc1ed90a">Update nvidia drivers for linux</a></li>
<li><a href="#orge61b6d9">chinese</a></li>
</ul>
</li>
<li><a href="#orge7f6c0c">System configuration collection</a>
<ul>
<li><a href="#org64bed5f">open fire wall  for port</a></li>
<li><a href="#org8d36fd0">Shutdown Keyboard default</a></li>
<li><a href="#org8061ac5">autostart</a></li>
<li><a href="#orgc5415fa">exchange Control Key and Caps Key</a></li>
<li><a href="#org56ed6ab">right key no response</a></li>
<li><a href="#orga5c0415">hotkey</a></li>
<li><a href="#org4442129">clear caches</a></li>
</ul>
</li>
<li><a href="#org4786c36">commands</a>
<ul>
<li><a href="#orgede84b4">file management</a></li>
<li><a href="#org6fca71a">directory operation</a></li>
<li><a href="#org5e68980">find uninstall and remove software</a></li>
<li><a href="#org189ab60">su password config</a></li>
<li><a href="#orgaf650d9">get IP address</a></li>
<li><a href="#org0da9bb0">grep sort</a></li>
<li><a href="#org8d6ac76">soft link</a></li>
<li><a href="#orgbba5793">hard link</a></li>
<li><a href="#orga14fe6a">cd to program with which</a></li>
<li><a href="#org46f06db">awk</a></li>
</ul>
</li>
<li><a href="#org0ac6976">Useful Software</a>
<ul>
<li><a href="#org3f7a25b">fcitx for sougou</a></li>
<li><a href="#orgae23a42">eog</a></li>
<li><a href="#org7ed2d54">Okular</a></li>
<li><a href="#orga3e68a4">xournal</a></li>
<li><a href="#org06fd76f">evince</a></li>
<li><a href="#orgbafecfb">stardict</a></li>
<li><a href="#org6f54372">kmplayer</a></li>
<li><a href="#org447abe1">simplescreenrecorder</a></li>
<li><a href="#org00ec639">Cvim</a></li>
<li><a href="#org70e99a7">hotopea</a></li>
<li><a href="#org9792c37">manual png create png</a></li>
<li><a href="#org8991afd">gpg for secret</a></li>
<li><a href="#org7873fbb">ranger</a></li>
<li><a href="#orga59949b">pdftk</a></li>
<li><a href="#org03a4881">Linux connect to Android</a></li>
<li><a href="#org3a95768">docker</a></li>
<li><a href="#org026e136">gs</a></li>
<li><a href="#org4d74bb1">mpv player</a></li>
<li><a href="#orgd7bc7f2">mellplayer</a></li>
<li><a href="#orgc5b3582">thunderbird</a></li>
<li><a href="#org4c5bef7">EverSync</a></li>
<li><a href="#org0510f48">IPFS</a></li>
<li><a href="#orgf3b1dfb">GPG</a></li>
</ul>
</li>
<li><a href="#org664966b">System control</a>
<ul>
<li><a href="#org279e920">system backup</a></li>
<li><a href="#orgca00f3d">system performance</a></li>
</ul>
</li>
<li><a href="#org470cdc7">chinese config</a>
<ul>
<li><a href="#orgbc01390">emacs chinese input</a></li>
<li><a href="#org28e7850">chinese output pdf</a></li>
</ul>
</li>
<li><a href="#org1aebb9a">hardware</a>
<ul>
<li><a href="#orga7b8424">memery</a></li>
</ul>
</li>
<li><a href="#org9e0e4ba">Makefile</a>
<ul>
<li><a href="#org2d87297">格式</a></li>
<li><a href="#orgec146eb">1example</a></li>
<li><a href="#org588b930">2修改后只编译改动后的文件</a></li>
<li><a href="#orgc4cd7bf">3使用自动变量</a></li>
<li><a href="#org1d32742">4增加可移植性</a></li>
<li><a href="#org138f580">5清洁中间的生成的不必要保存文件</a></li>
</ul>
</li>
<li><a href="#org82340dc">link</a>
<ul>
<li><a href="#org7b3f700">静态库的制作</a>
<ul>
<li><a href="#org2c82083">库方</a></li>
<li><a href="#org37e39c2">甲方</a></li>
<li><a href="#org6b24477">特点</a></li>
</ul>
</li>
<li><a href="#org6243487">动态库的制作</a>
<ul>
<li><a href="#org45a7b1e">环境变量</a></li>
<li><a href="#org2c58866">修改配置文件</a></li>
<li><a href="#orgb7df730">通过函数加载</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org860247f">BetreibenSystem</a>
<ul>
<li><a href="#org34f9ce6">exit</a></li>
<li><a href="#org493edb6">named pipe</a></li>
<li><a href="#org1389adc">unnamed pipe</a></li>
<li><a href="#orga0b6c0a">memcpy</a></li>
<li><a href="#org2527a6d">kill</a></li>
<li><a href="#org4940ca5">raise</a></li>
<li><a href="#orgf01a93a">alarm</a></li>
<li><a href="#org24fa24d">pause</a></li>
<li><a href="#orgec4fa8c">signal</a></li>
<li><a href="#orgd3f2d87">key</a></li>
<li><a href="#org56a77a8">shmget</a></li>
<li><a href="#orgc7d6fbc">shmat</a></li>
<li><a href="#org51109ce">shmdt</a></li>
<li><a href="#orgd19c9b8">shmctl</a></li>
<li><a href="#org1fa6cf5">IPC manipulation</a></li>
<li><a href="#orgf5f53b8">msgget</a></li>
<li><a href="#orgfbb08ea">msgctl</a></li>
<li><a href="#org410f9cd">msgsnd</a></li>
<li><a href="#orgd2425e3">msgrcv</a></li>
<li><a href="#org73ca6ea">semget</a></li>
<li><a href="#orgb56c693">semctl</a></li>
</ul>
</li>
<li><a href="#org32c870d">Git</a>
<ul>
<li><a href="#orga1c6310">tips</a></li>
<li><a href="#org175473f">Git installation in Linux</a></li>
<li><a href="#orgc645c81">Webconfig</a></li>
<li><a href="#org5eee56e">Connection</a></li>
<li><a href="#org9a6b00d">Magit Commit "C-x g" in E** Github on Windows</a></li>
<li><a href="#org120effb">Merge with aother branch</a></li>
<li><a href="#org317f970">Gitcommond</a>
<ul>
<li><a href="#org6d850c9">创建mybranch分支</a></li>
<li><a href="#org5be2431">merge mybranch分支到master分支</a></li>
<li><a href="#org061aab6">删除mybranch分支</a></li>
</ul>
</li>
<li><a href="#org2982ba2">commands</a></li>
<li><a href="#org4be9a5c">Magit</a></li>
<li><a href="#orgd2546a0">github conflict with local git</a></li>
<li><a href="#org6ff4f67">new system merge</a></li>
</ul>
</li>
<li><a href="#org7e8477b">note&#xa0;&#xa0;&#xa0;<span class="tag"><span class="crypt">crypt</span></span></a></li>
</ul>
</div>
</div>

<div id="outline-container-org9d12c48" class="outline-2">
<h2 id="org9d12c48">Install</h2>
<div class="outline-text-2" id="text-org9d12c48">
</div>
<div id="outline-container-orge82f6fe" class="outline-3">
<h3 id="orge82f6fe">系统盘恢复</h3>
<div class="outline-text-3" id="text-orge82f6fe">
<pre class="example">
1. WIN+R diskpart
2. select disk (Disk)
3. clean
4. new add 
</pre>
</div>
</div>
<div id="outline-container-orga612b6a" class="outline-3">
<h3 id="orga612b6a">写入系统</h3>
<div class="outline-text-3" id="text-orga612b6a">
<ol class="org-ol">
<li>下载ubuntu</li>
<li>下载USBwriter并安装</li>
<li>写入系</li>
</ol>
</div>
</div>

<div id="outline-container-org1338a59" class="outline-3">
<h3 id="org1338a59">安装</h3>
<div class="outline-text-3" id="text-org1338a59">
<pre class="example">
my computer : F12
</pre>
</div>
</div>
<div id="outline-container-orgc1ed90a" class="outline-3">
<h3 id="orgc1ed90a">Update nvidia drivers for linux</h3>
<div class="outline-text-3" id="text-orgc1ed90a">
<pre class="example">
sudo add-apt-repository ppa:graphics-drivers/ppa
sudo apt update 
ubuntu-drivers devices
sudo apt-get --reinstall install nvidia-430
    1.  will be asked for password
    2.  reboot
    3.  select Enroll MOK -&gt; continue -&gt; Yes -&gt; Roboot
nvidia-sim
watch -n 1 nvidia-smi
</pre>
</div>
</div>

<div id="outline-container-orge61b6d9" class="outline-3">
<h3 id="orge61b6d9">chinese</h3>
<div class="outline-text-3" id="text-orge61b6d9">
<p>
export LC<sub>CTYPE</sub>=zh<sub>CN.UTF</sub>-8
sudo apt-get -y install language-pack-zh-hans
此应用压制中英文的同步变化, 尽量避免使用中文
</p>
</div>
</div>
</div>
<div id="outline-container-orge7f6c0c" class="outline-2">
<h2 id="orge7f6c0c">System configuration collection</h2>
<div class="outline-text-2" id="text-orge7f6c0c">
</div>
<div id="outline-container-org64bed5f" class="outline-3">
<h3 id="org64bed5f">open fire wall  for port</h3>
<div class="outline-text-3" id="text-org64bed5f">
<p>
add port :
sudo firewall-cmd &#x2013;add-port=80/tcp &#x2013;permanent
restart firewall:
sudo  firewall-cmd &#x2013;reload
check port:
sudo  firewall-cmd &#x2013;list-all
</p>
</div>
</div>

<div id="outline-container-org8d36fd0" class="outline-3">
<h3 id="org8d36fd0">Shutdown Keyboard default</h3>
<div class="outline-text-3" id="text-org8d36fd0">
<pre class="example">

1. $ xinput list 
   Find the Touchpad and its NAME and ID
2. $ xinput set-prop 'NAME' 'Device Enabled' 0
   to close the Touchpad
3. but with following can be named as tpOn and tpOff in ./bashrc
alias tpOff="xinput set-prop 'SYNA1D31:00 06CB:CD48 Touchpad' 'Device Enabled' 0"
alias tpOn="xinput set-prop 'SYNA1D31:00 06CB:CD48 Touchpad' 'Device Enabled' 1"
4. Close Touchpad default in boost system
   the following in ~/.config/autostart/xinput.desktop
</pre>

<pre class="example">
[Desktop Entry]
Type=Application
Exec=xinput set-prop 'SYNA1D31:00 06CB:CD48 Touchpad' 'Device Enabled' 0
Hidden=false
NoDisplay=false
X-GNOME-Autostart-enabled=true
Name[zh_CN]=touchpad enable
Name=touchpad enable
</pre>
</div>
</div>
<div id="outline-container-org8061ac5" class="outline-3">
<h3 id="org8061ac5">autostart</h3>
<div class="outline-text-3" id="text-org8061ac5">
<p>
Thunderbird
</p>
<pre class="example">
[Desktop Entry]
Type=Application
Exec=/usr/bin/thunderbird
Hidden=false
NoDisplay=false
X-GNOME-Autostart-enabled=true
Name[en_US]=thunderbird
Name=thunderbird
Comment[en_US]=thunderbird
Comment=thunderbird

</pre>
</div>
</div>
<div id="outline-container-orgc5415fa" class="outline-3">
<h3 id="orgc5415fa">exchange Control Key and Caps Key</h3>
<div class="outline-text-3" id="text-orgc5415fa">
<p>
在/etc/default/keyboard文件中添加:
</p>
<pre class="example">
XKBOPTIONS="ctrl:nocaps
</pre>
<p>
or
</p>
<div class="org-src-container">
<pre class="src src-shell">setxkbmap -option ctrl:nocaps
</pre>
</div>
<p>
setting for 右键没反应
$ sudo add-apt-repository universe
$ sudo apt install gnome-tweak-tool
</p>
</div>
</div>

<div id="outline-container-org56ed6ab" class="outline-3">
<h3 id="org56ed6ab">right key no response</h3>
<div class="outline-text-3" id="text-org56ed6ab">
<pre class="example">
gsettings set org.gnome.desktop.peripherals.touchpad click-method areas
</pre>
</div>
</div>

<div id="outline-container-orga5c0415" class="outline-3">
<h3 id="orga5c0415">hotkey</h3>
<div class="outline-text-3" id="text-orga5c0415">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-M- t</td>
<td class="org-left">terminal</td>
</tr>

<tr>
<td class="org-left">C-M- p</td>
<td class="org-left">thunderbird</td>
</tr>

<tr>
<td class="org-left">C-M- e</td>
<td class="org-left">emacs</td>
</tr>

<tr>
<td class="org-left">C-M- f</td>
<td class="org-left">firefox</td>
</tr>

<tr>
<td class="org-left">C-M- j</td>
<td class="org-left">emacs windows switch</td>
</tr>

<tr>
<td class="org-left">C-M- t</td>
<td class="org-left">terminal</td>
</tr>

<tr>
<td class="org-left">C-M- w</td>
<td class="org-left">emacs worterbuch</td>
</tr>

<tr>
<td class="org-left">C-M- t</td>
<td class="org-left">terminal</td>
</tr>

<tr>
<td class="org-left">C-M- t</td>
<td class="org-left">terminal</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Switch application</td>
<td class="org-left">Alt + Tab</td>
</tr>

<tr>
<td class="org-left">Switch window of an application</td>
<td class="org-left">Alt + Spc</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Alt Ctrl Del</td>
<td class="org-left">退出用户</td>
</tr>
</tbody>
</table>

<p>
in Einstellung, the executable command can be used in command for customized hotkey
</p>
</div>
</div>
