linux.org
** clear caches
put this in .bashrc under root file
#+begin_src sh
alias freemem="sync; echo 3 > /proc/sys/vm/drop_caches && swapoff -a && swapon -a && printf '\n%s\n' 'Ram-cache and Swap Cleared' "
#+end_src
* commands
** file management

在~内找filename的文件
find ~ -name filename

找到.bash_history内带有"install"的内容
grep -n  "install" .bash_history

copy 110.txt to 111.txt
echo | cat 110.txt > 111.txt


> 擦除再写
>> 追加写入

读取.sdsv_history的不重复内容，再写入到.sdsv
echo | sort -n .sdsv_history |uniq > .sdsv

** directory operation
#+BEGIN_SRC 
tree -L 2
alias open='nautilus'
open .
#+END_SRC
** find uninstall and remove software
#+BEGIN_SRC 
sudo apt list --installed | grep software
whereis software
sudo apt-get --purge remove software
sudo apt-get autoremove
#+END_SRC
** su password config
sudo passwd :to configure the password of root user
** get IP address
curl ifconfig.me
** grep sort
grep -n "xxx" ./test.txt
sort (--reverse -t " " -k 3 ) test.csv
** soft link 
ln -s filename linkname // 快捷方式
filename加上绝对路径，linkname被移动后，仍能访问访问文件

** hard link
ln filename linkname   //硬链接
不占用磁盘空间，重复连接到文件的inode点。
可以在不同地方通过硬连接对文件进行操作

** cd to program with which
cd $(dirname $(which cling))

** awk 
 delete the repeat : awk '!a[$0]++' file.txt

* Useful Software
** fcitx for sougou
#+BEGIN_SRC 
1. sudo apt install fcitx
download sougou
2. sudo apt  --fix-broken install(after download)
3. export LC_CTYPE=zh_CN.UTF-8 (for Emacs)
#+END_SRC

** eog
#+BEGIN_SRC 
eog xxx.png to view png with bluit in software eog
#+END_SRC
** Okular
#+BEGIN_SRC 
sudo apt-get install okular
F2 to constimizer
F7 mode view
C-gg to the page
C-n page down
C-p page up
M-n scroll down
M-p scroll up
C-b C-b add Annoation, 1 to note
SPC-b add bookmark
SPC-SPC rename bookmark
SPC-n bookmark down
SPC-p bookmark up

#+END_SRC
** xournal
#+BEGIN_SRC  
sudo apt install xournal
#+END_SRC
** evince
#+BEGIN_SRC 
evince xxx.pdf to view pdf file

#+END_SRC
** stardict
#+BEGIN_SRC 
1 stardict 
2 sdcv
3 very useful  http://download.huzheng.org/

In GUI open with stardict
In terminal open with sdcv

#+END_SRC
** kmplayer
sudo apt install kmplayer
** simplescreenrecorder
#+BEGIN_SRC 

sudo apt install simplescreenrecorder
alias ssr='simplescreenrecorder'
$ ssr
Ctrl + Shift + Alt + V start or pause 

#+END_SRC
** Cvim
#+BEGIN_SRC 
C-j moive to left 
C-k moive to right

#+END_SRC
** hotopea
登陆photopea网站后，新建并上传图片
设置白色背景：图像 -> 调整 -> 色阶  点击下面的白色 后点击要处理的图片区域
去背景 ： 魔术棒 ， 点击去连续， 再直接delete
** manual png create png

after edit a file.dot

dot -Tpng -O file.dot

** gpg for secret

#+BEGIN_SRC 
gpg --list-secret-keys
gpg -r user -e xxx.file
gpg -d xxx.file.gpg
after change xxx.file :gpg --verify xxx.file.gpg

#+END_SRC

** ranger
apt install
** pdftk

[[http://www.pdflabs.com/docs/install-pdftk/][official web link]]

|------------------+-------------------------------------------------------------|
| 合并             | pdftk 1.pdf 2.pdf 3.pdf output 123.pdf                      |
| 多个不同页面合并 | pdftk A=1.pdf B=2.pdf C=pdf cat A1-2 B2-3 C3 output abc.pdf |
| 旋转第一页       | pdftk in.pdf cat 1E 2-end output out.pdf                    |
| 加密（128位）    | pdftk a.pdf output b.pdf owner_pw pass                      |
| 加访问密码       | pdftk a.pdf output b.pdf user_pw pass                       |
| 解密             | pdftk a.pdf input_pw pass output b.pdf                      |
| 解压             | pdftk a.pdf output b.pdf uncompress                         |
| 压缩             | pdftk a.pdf output b.pdf compress                           |
| 修复             | pdftk a.pdf output b.pdf                                    |
| 切割             | pdftk a.pdf cat 1-end output b.pdf                          |
| 分解成单页       | pdftk a.pdf burst                                           |
|------------------+-------------------------------------------------------------|

** Linux connect to Android
#+begin_src 
kedconnect on linux
kedconnect on android
with  the same internet connection can be found each other, and communication

#+end_src

#+begin_src 
The file can be found in Download folder of each devices
#+end_src

** docker


|------------------------------+-----------------|
| comands                      | expains         |
|------------------------------+-----------------|
| docker images                | 查看容器        |
| docker pull nginx            | 新增            |
| docker run -d -p 80:80 nginx | 开始，id， 后台 |
| docker exec -it xxxxxx bash  | 前台进入，      |
| docker commit xxxxxx newname | 生成新容器      |
| docker kill -s KILL xxxxxx   | 关闭            |
|------------------------------+-----------------|

** gs
remove active content from pdf 
gs -dNOPAUSE -sDEVICE=pdfwrite -sOUTPUTFILE=CV.pdf -dBATCH CV.pdf
