linux.html

<div id="outline-container-org4442129" class="outline-3">
<h3 id="org4442129">clear caches</h3>
<div class="outline-text-3" id="text-org4442129">
<p>
put this in .bashrc under root file
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">alias</span> <span style="color: #7590db;">freemem</span>=<span style="color: #2d9574;">"sync; echo 3 &gt; /proc/sys/vm/drop_caches &amp;&amp; swapoff -a &amp;&amp; swapon -a &amp;&amp; printf '\n%s\n' 'Ram-cache and Swap Cleared' "</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4786c36" class="outline-2">
<h2 id="org4786c36">commands</h2>
<div class="outline-text-2" id="text-org4786c36">
</div>
<div id="outline-container-orgede84b4" class="outline-3">
<h3 id="orgede84b4">file management</h3>
<div class="outline-text-3" id="text-orgede84b4">
<p>
在~内找filename的文件
find ~ -name filename
</p>

<p>
找到.bash<sub>history内带有</sub>"install"的内容
grep -n  "install" .bash<sub>history</sub>
</p>

<p>
copy 110.txt to 111.txt
echo | cat 110.txt &gt; 111.txt
</p>


<p>
&gt; 擦除再写
&gt;&gt; 追加写入
</p>

<p>
读取.sdsv<sub>history的不重复内容</sub>，再写入到.sdsv
echo | sort -n .sdsv<sub>history</sub> |uniq &gt; .sdsv
</p>
</div>
</div>

<div id="outline-container-org6fca71a" class="outline-3">
<h3 id="org6fca71a">directory operation</h3>
<div class="outline-text-3" id="text-org6fca71a">
<pre class="example">
tree -L 2
alias open='nautilus'
open .
</pre>
</div>
</div>
<div id="outline-container-org5e68980" class="outline-3">
<h3 id="org5e68980">find uninstall and remove software</h3>
<div class="outline-text-3" id="text-org5e68980">
<pre class="example">
sudo apt list --installed | grep software
whereis software
sudo apt-get --purge remove software
sudo apt-get autoremove
</pre>
</div>
</div>
<div id="outline-container-org189ab60" class="outline-3">
<h3 id="org189ab60">su password config</h3>
<div class="outline-text-3" id="text-org189ab60">
<p>
sudo passwd :to configure the password of root user
</p>
</div>
</div>
<div id="outline-container-orgaf650d9" class="outline-3">
<h3 id="orgaf650d9">get IP address</h3>
<div class="outline-text-3" id="text-orgaf650d9">
<p>
curl ifconfig.me
</p>
</div>
</div>
<div id="outline-container-org0da9bb0" class="outline-3">
<h3 id="org0da9bb0">grep sort</h3>
<div class="outline-text-3" id="text-org0da9bb0">
<p>
grep -n "xxx" ./test.txt
sort (&#x2013;reverse -t " " -k 3 ) test.csv
</p>
</div>
</div>
<div id="outline-container-org8d6ac76" class="outline-3">
<h3 id="org8d6ac76">soft link</h3>
<div class="outline-text-3" id="text-org8d6ac76">
<p>
ln -s filename linkname // 快捷方式
filename加上绝对路径，linkname被移动后，仍能访问访问文件
</p>
</div>
</div>

<div id="outline-container-orgbba5793" class="outline-3">
<h3 id="orgbba5793">hard link</h3>
<div class="outline-text-3" id="text-orgbba5793">
<p>
ln filename linkname   //硬链接
不占用磁盘空间，重复连接到文件的inode点。
可以在不同地方通过硬连接对文件进行操作
</p>
</div>
</div>

<div id="outline-container-orga14fe6a" class="outline-3">
<h3 id="orga14fe6a">cd to program with which</h3>
<div class="outline-text-3" id="text-orga14fe6a">
<p>
cd $(dirname $(which cling))
</p>
</div>
</div>

<div id="outline-container-org46f06db" class="outline-3">
<h3 id="org46f06db">awk</h3>
<div class="outline-text-3" id="text-org46f06db">
<p>
delete the repeat : awk '!a[$0]++' file.txt
</p>
</div>
</div>
</div>

<div id="outline-container-org0ac6976" class="outline-2">
<h2 id="org0ac6976">Useful Software</h2>
<div class="outline-text-2" id="text-org0ac6976">
</div>
<div id="outline-container-org3f7a25b" class="outline-3">
<h3 id="org3f7a25b">fcitx for sougou</h3>
<div class="outline-text-3" id="text-org3f7a25b">
<pre class="example">
1. sudo apt install fcitx
download sougou
2. sudo apt  --fix-broken install(after download)
3. export LC_CTYPE=zh_CN.UTF-8 (for Emacs)
</pre>
</div>
</div>

<div id="outline-container-orgae23a42" class="outline-3">
<h3 id="orgae23a42">eog</h3>
<div class="outline-text-3" id="text-orgae23a42">
<pre class="example">
eog xxx.png to view png with bluit in software eog
</pre>
</div>
</div>
<div id="outline-container-org7ed2d54" class="outline-3">
<h3 id="org7ed2d54">Okular</h3>
<div class="outline-text-3" id="text-org7ed2d54">
<pre class="example">
sudo apt-get install okular
F2 to constimizer
F7 mode view
C-gg to the page
C-n page down
C-p page up
M-n scroll down
M-p scroll up
C-b C-b add Annoation, 1 to note
SPC-b add bookmark
SPC-SPC rename bookmark
SPC-n bookmark down
SPC-p bookmark up

</pre>
</div>
</div>
<div id="outline-container-orga3e68a4" class="outline-3">
<h3 id="orga3e68a4">xournal</h3>
<div class="outline-text-3" id="text-orga3e68a4">
<pre class="example">
sudo apt install xournal
</pre>
</div>
</div>
<div id="outline-container-org06fd76f" class="outline-3">
<h3 id="org06fd76f">evince</h3>
<div class="outline-text-3" id="text-org06fd76f">
<pre class="example">
evince xxx.pdf to view pdf file

</pre>
</div>
</div>
<div id="outline-container-orgbafecfb" class="outline-3">
<h3 id="orgbafecfb">stardict</h3>
<div class="outline-text-3" id="text-orgbafecfb">
<pre class="example">
1 stardict 
2 sdcv
3 very useful  http://download.huzheng.org/

In GUI open with stardict
In terminal open with sdcv

</pre>
</div>
</div>
<div id="outline-container-org6f54372" class="outline-3">
<h3 id="org6f54372">kmplayer</h3>
<div class="outline-text-3" id="text-org6f54372">
<p>
sudo apt install kmplayer
</p>
</div>
</div>
<div id="outline-container-org447abe1" class="outline-3">
<h3 id="org447abe1">simplescreenrecorder</h3>
<div class="outline-text-3" id="text-org447abe1">
<pre class="example">

sudo apt install simplescreenrecorder
alias ssr='simplescreenrecorder'
$ ssr
Ctrl + Shift + Alt + V start or pause 

</pre>
</div>
</div>
<div id="outline-container-org00ec639" class="outline-3">
<h3 id="org00ec639">Cvim</h3>
<div class="outline-text-3" id="text-org00ec639">
<pre class="example">
C-j moive to left 
C-k moive to right

</pre>
</div>
</div>
<div id="outline-container-org70e99a7" class="outline-3">
<h3 id="org70e99a7">hotopea</h3>
<div class="outline-text-3" id="text-org70e99a7">
<p>
登陆photopea网站后，新建并上传图片
设置白色背景：图像 -&gt; 调整 -&gt; 色阶  点击下面的白色 后点击要处理的图片区域
去背景 ： 魔术棒 ， 点击去连续， 再直接delete
</p>
</div>
</div>
<div id="outline-container-org9792c37" class="outline-3">
<h3 id="org9792c37">manual png create png</h3>
<div class="outline-text-3" id="text-org9792c37">
<p>
after edit a file.dot
</p>

<p>
dot -Tpng -O file.dot
</p>
</div>
</div>

<div id="outline-container-org8991afd" class="outline-3">
<h3 id="org8991afd">gpg for secret</h3>
<div class="outline-text-3" id="text-org8991afd">
<pre class="example">
gpg --list-secret-keys
gpg -r user -e xxx.file
gpg -d xxx.file.gpg
after change xxx.file :gpg --verify xxx.file.gpg

</pre>
</div>
</div>

<div id="outline-container-org7873fbb" class="outline-3">
<h3 id="org7873fbb">ranger</h3>
<div class="outline-text-3" id="text-org7873fbb">
<p>
apt install
</p>
</div>
</div>
<div id="outline-container-orga59949b" class="outline-3">
<h3 id="orga59949b">pdftk</h3>
<div class="outline-text-3" id="text-orga59949b">
<p>
<a href="http://www.pdflabs.com/docs/install-pdftk/">official web link</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">合并</td>
<td class="org-left">pdftk 1.pdf 2.pdf 3.pdf output 123.pdf</td>
</tr>

<tr>
<td class="org-left">多个不同页面合并</td>
<td class="org-left">pdftk A=1.pdf B=2.pdf C=pdf cat A1-2 B2-3 C3 output abc.pdf</td>
</tr>

<tr>
<td class="org-left">旋转第一页</td>
<td class="org-left">pdftk in.pdf cat 1E 2-end output out.pdf</td>
</tr>

<tr>
<td class="org-left">加密（128位）</td>
<td class="org-left">pdftk a.pdf output b.pdf owner<sub>pw</sub> pass</td>
</tr>

<tr>
<td class="org-left">加访问密码</td>
<td class="org-left">pdftk a.pdf output b.pdf user<sub>pw</sub> pass</td>
</tr>

<tr>
<td class="org-left">解密</td>
<td class="org-left">pdftk a.pdf input<sub>pw</sub> pass output b.pdf</td>
</tr>

<tr>
<td class="org-left">解压</td>
<td class="org-left">pdftk a.pdf output b.pdf uncompress</td>
</tr>

<tr>
<td class="org-left">压缩</td>
<td class="org-left">pdftk a.pdf output b.pdf compress</td>
</tr>

<tr>
<td class="org-left">修复</td>
<td class="org-left">pdftk a.pdf output b.pdf</td>
</tr>

<tr>
<td class="org-left">切割</td>
<td class="org-left">pdftk a.pdf cat 1-end output b.pdf</td>
</tr>

<tr>
<td class="org-left">分解成单页</td>
<td class="org-left">pdftk a.pdf burst</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org03a4881" class="outline-3">
<h3 id="org03a4881">Linux connect to Android</h3>
<div class="outline-text-3" id="text-org03a4881">
<pre class="example">
kedconnect on linux
kedconnect on android
with  the same internet connection can be found each other, and communication

</pre>

<pre class="example">
The file can be found in Download folder of each devices
</pre>
</div>
</div>

<div id="outline-container-org3a95768" class="outline-3">
<h3 id="org3a95768">docker</h3>
<div class="outline-text-3" id="text-org3a95768">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">comands</th>
<th scope="col" class="org-left">expains</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">docker images</td>
<td class="org-left">查看容器</td>
</tr>

<tr>
<td class="org-left">docker pull nginx</td>
<td class="org-left">新增</td>
</tr>

<tr>
<td class="org-left">docker run -d -p 80:80 nginx</td>
<td class="org-left">开始，id， 后台</td>
</tr>

<tr>
<td class="org-left">docker exec -it xxxxxx bash</td>
<td class="org-left">前台进入，</td>
</tr>

<tr>
<td class="org-left">docker commit xxxxxx newname</td>
<td class="org-left">生成新容器</td>
</tr>

<tr>
<td class="org-left">docker kill -s KILL xxxxxx</td>
<td class="org-left">关闭</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org026e136" class="outline-3">
<h3 id="org026e136">gs</h3>
<div class="outline-text-3" id="text-org026e136">
<p>
remove active content from pdf 
gs -dNOPAUSE -sDEVICE=pdfwrite -sOUTPUTFILE=CV.pdf -dBATCH CV.pdf
</p>
</div>
</div>
