linux.html
<div id="outline-container-org4d74bb1" class="outline-3">
<h3 id="org4d74bb1">mpv player</h3>
<div class="outline-text-3" id="text-org4d74bb1">
<p>
sudo apt install mpv
</p>

<p>
mpv.conf
</p>
<pre class="example">
no-osd-bar # 去掉白色进度条
save-position-on-quit # 关闭时记住文件播放位置
no-border # 去掉边框

# 解码-字幕
vo=opengl:gamma-auto:icc-profile-auto
hwdec=auto
autofit-larger=92%
playcache=8192
lang=zh,chi
video-sync=display-resample

sub-codepage=enca:zh:utf8
sub-auto=fuzzy
sub-text-font-size=40
sub-text-shadow-offset=0
sub-text-color="#ffffffff"
sub-text-font="STZhongsong"
sub-codepage=utf8:gb18030

screenshot-template=mpv-screenshot-%f-%p
screenshot-format=png

osd-font="STZhongsong"
osd-font-size=36

--script=/Users/yourname/.config/mpv/autoload.lua

</pre>

<p>
autoload.lua
</p>
<pre class="example">
-- This script automatically loads playlist entries before and after the
-- the currently played file. It does so by scanning the directory a file is
-- located in when starting playback. It sorts the directory entries
-- alphabetically, and adds entries before and after the current file to
-- the internal playlist. (It stops if the it would add an already existing
-- playlist entry at the same position - this makes it "stable".)
-- Add at most 5000 * 2 files when starting a file (before + after).
MAXENTRIES = 5000

function Set (t)
    local set = {}
    for _, v in pairs(t) do set[v] = true end
    return set
end

EXTENSIONS = Set {
    'mkv', 'avi', 'mp4', 'ogv', 'webm', 'rmvb', 'flv', 'wmv', 'mpeg', 'mpg', 'm4v', '3gp',
    'mp3', 'wav', 'ogv', 'flac', 'm4a', 'wma',
}

mputils = require 'mp.utils'

function add_files_at(index, files)
    index = index - 1
    local oldcount = mp.get_property_number("playlist-count", 1)
    for i = 1, #files do
	mp.commandv("loadfile", files[i], "append")
	mp.commandv("playlist-move", oldcount + i - 1, index + i - 1)
    end
end

function get_extension(path)
    match = string.match(path, "%.([^%.]+)$" )
    if match == nil then
	return "nomatch"
    else
	return match
    end
end

table.filter = function(t, iter)
    for i = #t, 1, -1 do
	if not iter(t[i]) then
	    table.remove(t, i)
	end
    end
end

function find_and_add_entries()
    local path = mp.get_property("path", "")
    local dir, filename = mputils.split_path(path)
    if #dir == 0 then
	return
    end
    local pl_count = mp.get_property_number("playlist-count", 1)
    if (pl_count &gt; 1 and autoload == nil) or
       (pl_count == 1 and EXTENSIONS[string.lower(get_extension(filename))] == nil) then
	return
    else
	autoload = true
    end

    local files = mputils.readdir(dir, "files")
    if files == nil then
	return
    end
    table.filter(files, function (v, k)
	local ext = get_extension(v)
	if ext == nil then
	    return false
	end
	return EXTENSIONS[string.lower(ext)]
    end)
    table.sort(files, function (a, b)
	local len = string.len(a) - string.len(b)
	if len ~= 0 then -- case for ordering filename ending with such as X.Y.Z
	    local ext = string.len(get_extension(a)) + 1
	    return string.sub(a, 1, -ext) &lt; string.sub(b, 1, -ext)
	end
	return string.lower(a) &lt; string.lower(b)
    end)

    if dir == "." then
	dir = ""
    end

    local pl = mp.get_property_native("playlist", {})
    local pl_current = mp.get_property_number("playlist-pos", 0) + 1
    -- Find the current pl entry (dir+"/"+filename) in the sorted dir list
    local current
    for i = 1, #files do
	if files[i] == filename then
	    current = i
	    break
	end
    end
    if current == nil then
	return
    end

    local append = {[-1] = {}, [1] = {}}
    for direction = -1, 1, 2 do -- 2 iterations, with direction = -1 and +1
	for i = 1, MAXENTRIES do
	    local file = files[current + i * direction]
	    local pl_e = pl[pl_current + i * direction]
	    if file == nil or file[1] == "." then
		break
	    end

	    local filepath = dir .. file
	    if pl_e then
		-- If there's a playlist entry, and it's the same file, stop.
		if pl_e.filename == filepath then
		    break
		end
	    end

	    if direction == -1 then
		if pl_current == 1 then -- never add additional entries in the middle
		    mp.msg.info("Prepending " .. file)
		    table.insert(append[-1], 1, filepath)
		end
	    else
		mp.msg.info("Adding " .. file)
		table.insert(append[1], filepath)
	    end
	end
    end

    add_files_at(pl_current + 1, append[1])
    add_files_at(pl_current, append[-1])
end

mp.register_event("start-file", find_and_add_entries)

</pre>
</div>
</div>

<div id="outline-container-orgd7bc7f2" class="outline-3">
<h3 id="orgd7bc7f2">mellplayer</h3>
<div class="outline-text-3" id="text-orgd7bc7f2">
<p>
sudo apt-get install libmpv-dev mpv
</p>
</div>
</div>

<div id="outline-container-orgc5b3582" class="outline-3">
<h3 id="orgc5b3582">thunderbird</h3>
<div class="outline-text-3" id="text-orgc5b3582">
<pre class="example">
Alt to open the menubar,
Ansicht Anpassen to setting ungelesen
</pre>
</div>
</div>

<div id="outline-container-org4c5bef7" class="outline-3">
<h3 id="org4c5bef7">EverSync</h3>
<div class="outline-text-3" id="text-org4c5bef7">
<p>
Eversync sync all bookmarks between chrome and firefox with G Konten
</p>
</div>
</div>
<div id="outline-container-org0510f48" class="outline-3">
<h3 id="org0510f48">IPFS</h3>
<div class="outline-text-3" id="text-org0510f48">
<pre class="example">

download go-ipfs and untar
cp ipfs /usr/local/bin and sudo ./install.sh

sudo apt install ipfs

ipfs init
export EDITOR=/usr/bin/emacs
ipfs config edit
ipfs id
ipfs  help
</pre>


<pre class="example">

mkdir IPFS
echo "balabalu" &gt; hallo.org
ipfs add hallo.org  :get file_hash
ipfs cat file_hash
ipfs.io/ipfs/file_hash
</pre>

<p>
push
</p>

<pre class="example">

ipfs add -r . (we get all file_hash(s), and a folder_hash(IPFS))
ipfs name publish folder_hash  (: to IDHASH)

in Webborser: ipfs.io/ipns/IDHASH


ipfs name resolve IDHASH : to HASH_file

特殊加密，暂时不用
ipfs key gen --type=rsa --size=2048 IPFS
ipfs name publish --key=IPFS folder_hash
</pre>


<pre class="example">
ipfs config --json API.HTTPHeaders.Access-Control-Allow-Methods '["PUT", "GET", "POST","OPTIONS"]'

ipfs config --json API.HTTPHeaders.Access-Control-Allow-Origin '["*"]'

ipfs config --json API.HTTPHeaders.Access-Control-Allow-Credentials '["true"]'

ipfs config --json API.HTTPHeaders.Access-Control-Allow-Headers '["Authorization"]'

ipfs config --json API.HTTPHeaders.Access-Control-Expose-Headers '["Location"]'


http://localhost:5001/webui

</pre>

<pre class="example">

ipfs files mkdir /Docu

ipfs files ls /Docu

ipfs file cp /ipfs/HASH
</pre>
</div>
</div>
<div id="outline-container-orgf3b1dfb" class="outline-3">
<h3 id="orgf3b1dfb">GPG</h3>
<div class="outline-text-3" id="text-orgf3b1dfb">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">terminal encrypt</td>
<td class="org-left">gpg &#x2013;recipient ID &#x2013;output en.org &#x2013;encrypt source.org</td>
</tr>

<tr>
<td class="org-left">terminal decrypt</td>
<td class="org-left">gpg  en.org</td>
</tr>

<tr>
<td class="org-left">emacs encrypt</td>
<td class="org-left">epa-encrypt-file</td>
</tr>

<tr>
<td class="org-left">emacs decrypt</td>
<td class="org-left">epa-decrypt-file</td>
</tr>
</tbody>
</table>

<p>
encrypt by terminal, once decrypt by emacs, just as normal file, can be edited anytime
encrypt by emacs with password, passwd will be ask every time by after edit
if epa-file-select-key is t
</p>
</div>
</div>
</div>

<div id="outline-container-org664966b" class="outline-2">
<h2 id="org664966b">System control</h2>
<div class="outline-text-2" id="text-org664966b">
</div>
<div id="outline-container-org279e920" class="outline-3">
<h3 id="org279e920">system backup</h3>
<div class="outline-text-3" id="text-org279e920">
<p>
mount rsync
</p>

<p>
查看系统的磁盘 :lsblk
再将磁盘(也可以是某个分区)挂载到某个点 :
</p>

<p>
该磁盘可以是正在使用的磁盘或者分区  
</p>
<pre class="example">
 mount /dev/disk /media/Linux
sudo mount /dev/sda1 /media/Backup

rsync -aAXv --delete --exclude=media target backup/LinuxBackUp20200316
my opera 

rsync -aAXv /home/sx/ /media/sx/A672BA1B72B9EFE3/linuxbackup/home/

</pre>
<p>
如果要恢复，重复上面的过程，再将target backup 交换
</p>
</div>
</div>
