linux.html

<div id="outline-container-orgca00f3d" class="outline-3">
<h3 id="orgca00f3d">system performance</h3>
<div class="outline-text-3" id="text-orgca00f3d">
<ol class="org-ol">
<li>dependence</li>
</ol>
<p>
sudo apt-get install gir1.2-gtop-2.0 gir1.2-networkmanager-1.0
gir1.2-clutter-1.0
</p>

<ol class="org-ol">
<li>Ubuntu Software</li>
</ol>
<p>
search for : system moniter extension
</p>

<ol class="org-ol">
<li>install and configure performance</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org470cdc7" class="outline-2">
<h2 id="org470cdc7">chinese config</h2>
<div class="outline-text-2" id="text-org470cdc7">
</div>
<div id="outline-container-orgbc01390" class="outline-3">
<h3 id="orgbc01390">emacs chinese input</h3>
<div class="outline-text-3" id="text-orgbc01390">
<p>
sudo apt install fcitx
download sougou for linux
sudo dpkg -i sougou&#x2026;&#x2026;
fcitx set global
restart configuration to add sougou chinese
</p>


<p>
$ local -a |grep zh
sudo apt-get -y install language-pack-zh-hans
$ local -a |grep zh 
to see zh is installed
</p>

<p>
export LC<sub>CTYPE</sub>=zh<sub>CN.UTF</sub>-8
to language configuration and auto install drivers to zh<sub>CN.UTF</sub>-8
so in emacs can input sougou, here we go
</p>
</div>
</div>

<div id="outline-container-org28e7850" class="outline-3">
<h3 id="org28e7850">chinese output pdf</h3>
<div class="outline-text-3" id="text-org28e7850">
<p>
for a orgmode file with 汉字
pandoc xxxx.org -o xxxx.pdf
pandoc xxxx.org -o xxxx.pdf &#x2013;pdf-engine=xelatex
如果没有汉字支持
</p>
<pre class="example">
fc-list -f "%{family}\n"  :lang=zh
pandoc test.org -o test.pdf --pdf-engine=xelatex -V mainfont="AR PL KaitiM GB"
</pre>
<p>
找到支持的格式，再指明
</p>
</div>
</div>
</div>

<div id="outline-container-org1aebb9a" class="outline-2">
<h2 id="org1aebb9a">hardware</h2>
<div class="outline-text-2" id="text-org1aebb9a">
</div>
<div id="outline-container-orga7b8424" class="outline-3">
<h3 id="orga7b8424">memery</h3>
<div class="outline-text-3" id="text-orga7b8424">
<pre class="example">
寻址能力 = 2^地址总线宽度
处理能力 = 2^数据总线宽度
数据总线宽度受制于计算机位数
</pre>
</div>
</div>
</div>

<div id="outline-container-org9e0e4ba" class="outline-2">
<h2 id="org9e0e4ba">Makefile</h2>
<div class="outline-text-2" id="text-org9e0e4ba">
<p>
gcc 调用 make 来构造
</p>
</div>

<div id="outline-container-org2d87297" class="outline-3">
<h3 id="org2d87297">格式</h3>
<div class="outline-text-3" id="text-org2d87297">
<p>
目标 ： 依赖
Tab 命令
</p>
</div>
</div>

<div id="outline-container-orgec146eb" class="outline-3">
<h3 id="orgec146eb">1example</h3>
<div class="outline-text-3" id="text-orgec146eb">
<p>
实列文件：add.c  head.h   main.c   maul.c  sub.c  
直接在terminal 用gcc ：$ gcc add.c main.c sub.c -o app
</p>

<p>
Makefile :
$ touch Makefile
</p>
<div class="org-src-container">
<pre class="src src-txt">app: main.c add.c sub.c mul.c
    gcc main.c add.c sub.c mul.c 
</pre>
</div>
<p>
$ make
</p>
</div>
</div>

<div id="outline-container-org588b930" class="outline-3">
<h3 id="org588b930">2修改后只编译改动后的文件</h3>
<div class="outline-text-3" id="text-org588b930">
<p>
Makefile :
$ touch Makefile
</p>
<div class="org-src-container">
<pre class="src src-txt">app: main.o add.o sub.o mul.o
    gcc main.o add.o sub.o mul.o -o app

main.o: main.c
    gcc -c main.c -o main.o

add.o: add.c
    gcc -c add.c -o add.o

sub.o: sub.c
    gcc -c sub.c -o sub.o

mul.o: mul.c
    gcc -c mul.c -o mul.o

</pre>
</div>
<p>
$ make
所有源文件的修改过，即时间戳晚于生成的目标文件，则重新编译
</p>
</div>
</div>

<div id="outline-container-orgc4cd7bf" class="outline-3">
<h3 id="orgc4cd7bf">3使用自动变量</h3>
<div class="outline-text-3" id="text-orgc4cd7bf">
<p>
$@ :目标
$&lt; :第一个依赖 
$^ :所有依赖
Makefile :
$ touch Makefile
</p>

<div class="org-src-container">
<pre class="src src-txt">obj =   main.o add.o sub.o mul.o
target = app

$(target):$(obj)
    gcc $(obj) -o $(target)  // gcc $^ -o $@

%.o:%.c
    gcc -c $&lt; -o $@

</pre>
</div>
<p>
$ make
</p>
</div>
</div>

<div id="outline-container-org1d32742" class="outline-3">
<h3 id="org1d32742">4增加可移植性</h3>
<div class="outline-text-3" id="text-org1d32742">
<p>
wildcard :查找指定目录下的指定类型文件
src = $(wildcard ./*.c)
将当前目录下所有的.c 找到，并赋给src
</p>

<p>
patsubst :匹配替换
obj = $(patsubst %.c, %.o, $(src))
将src中的所有.c替换为.o
</p>

<p>
Makefile :
$ touch Makefile
</p>

<div class="org-src-container">
<pre class="src src-txt">src = $(wildcard ./*.c)
obj = $(patsubst %.c, %.o $(src))
target = app

$(target):$(obj)
    gcc $^ -o $@

%.o:%.c
    gcc -c $&lt; -o $@

</pre>
</div>
<p>
$ make
此文件在别的目录下也能使用
</p>
</div>
</div>

<div id="outline-container-org138f580" class="outline-3">
<h3 id="org138f580">5清洁中间的生成的不必要保存文件</h3>
<div class="outline-text-3" id="text-org138f580">
<p>
make 一般直接执行终结目标，但是可以直接指定make的函数
clean : 删除不必要的文件，-f : 强制删除，不管有没有该文件，- : 前置-后，遇到错误执行，直接跳过
</p>

<div class="org-src-container">
<pre class="src src-txt">src = $(wildcard ./*.c)
obj = $(patsubst %.c, %.o $(src))
target = app

$(target):$(obj)
    gcc $^ -o $@

%.o:%.c
    gcc -c $&lt; -o $@

clean:
    rm $(obj) $(target)
    rm $(obj) $(target) -f
    -rm $(obj) $(target) -f

</pre>
</div>

<p>
$ make
$ make clean
</p>
</div>
</div>
</div>

<div id="outline-container-org82340dc" class="outline-2">
<h2 id="org82340dc">link</h2>
<div class="outline-text-2" id="text-org82340dc">
</div>
<div id="outline-container-org7b3f700" class="outline-3">
<h3 id="org7b3f700">静态库的制作</h3>
<div class="outline-text-3" id="text-org7b3f700">
</div>
<div id="outline-container-org2c82083" class="outline-4">
<h4 id="org2c82083">库方</h4>
<div class="outline-text-4" id="text-org2c82083">
<p>
include/head.h  lib/  src/
将在src/中编写要实现的文件
并编译这些文件             $ gcc *.c -c -I ../include/
-I :链接头文件
再将这些编译后的打包       $ ar rcs libtest.a *.o
ar : -archive 打包
检测 : nm libtest.a
前缀lib 和后缀.a 不能更改，实际名字是test
</p>

<p>
最后将生成的libtest.a放到上级目录lib中，
可以将lib和include目录发送给甲方
</p>
</div>
</div>

<div id="outline-container-org37e39c2" class="outline-4">
<h4 id="org37e39c2">甲方</h4>
<div class="outline-text-4" id="text-org37e39c2">
<p>
根据include/head.h 的头文件编写自己的应用文件main.c
编译main.c并链接头文件和库 
  $ gcc main.c -I  ./include/ -L ./lib/ -ltest -o app
-I : 连接头文件
-L : 链接库
-ltest : 链接库文件，去头lib 去尾.a
-o: 指点生成的应用名
</p>
</div>
</div>

<div id="outline-container-org6b24477" class="outline-4">
<h4 id="org6b24477">特点</h4>
<div class="outline-text-4" id="text-org6b24477">
<p>
优点： 加载块，移植方便
缺点 ：部署更新麻烦，引用的重复文件重复储存，浪费空间
</p>
</div>
</div>
</div>

<div id="outline-container-org6243487" class="outline-3">
<h3 id="org6243487">动态库的制作</h3>
<div class="outline-text-3" id="text-org6243487">
<p>
编译    $ gcc *.c -c -fpic -I ../include
-fpic 或者 fPIC : 特殊命令
打包    $ gcc -shared *.o -o libxxx.so
头lib 尾.so 
</p>

<p>
使用和静态库相似， 根据头文件编写应用文件main.c
$ gcc main.c -I ./inculde/ -L ./lib/ -lxxx -o app
</p>

<p>
对于linux生成的文件都是elf格式，并由ld-libc.so动态加载,需要让app能别找
到可以用环境变量或者配置文件
</p>
</div>

<div id="outline-container-org45a7b1e" class="outline-4">
<h4 id="org45a7b1e">环境变量</h4>
<div class="outline-text-4" id="text-org45a7b1e">
<p>
临时设置   
  $ export LD<sub>LIBRARY</sub><sub>PATH</sub>=./lib
或者新增   
  $ export LD<sub>LIBRARY</sub><sub>PATH</sub>=./lib:LD<sub>LIBRARY</sub><sub>PATH</sub>
</p>

<p>
临时设置可以使用相对路径，
</p>

<p>
永久设置 用户
$ cat " LD<sub>LIBRARY</sub><sub>PATH</sub>=./lib:LD<sub>LIBRARY</sub><sub>PATH</sub>" &gt;&gt; ~/.bashrc
$ source ~./bashrc
</p>

<p>
永久设置 系统
$ sudo cat "LD<sub>LIBRARY</sub><sub>PATH</sub>=./lib:LD<sub>LIBRARY</sub><sub>PATH</sub>" &gt;&gt; /etc/profile
$ source /etc/profile
</p>
</div>
</div>

<div id="outline-container-org2c58866" class="outline-4">
<h4 id="org2c58866">修改配置文件</h4>
<div class="outline-text-4" id="text-org2c58866">
<p>
配置文件/etc/ld.so.conf
$ sudo cat "绝对路径/lib" &gt;&gt; /etc/ld.so.conf
$ sudo ldconfig -v 激活配置
</p>
</div>
</div>

<div id="outline-container-orgb7df730" class="outline-4">
<h4 id="orgb7df730">通过函数加载</h4>
<div class="outline-text-4" id="text-orgb7df730">
<p>
dlopen dlclose dlsym
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org860247f" class="outline-2">
<h2 id="org860247f">BetreibenSystem</h2>
<div class="outline-text-2" id="text-org860247f">
</div>
<div id="outline-container-org34f9ce6" class="outline-3">
<h3 id="org34f9ce6">exit</h3>
<div class="outline-text-3" id="text-org34f9ce6">
<p>
exit(0) will also send signal 17 (SIGCHID) to its father thread;
</p>
</div>
</div>

<div id="outline-container-org493edb6" class="outline-3">
<h3 id="org493edb6">named pipe</h3>
<div class="outline-text-3" id="text-org493edb6">
<ol class="org-ol">
<li>In current directory:   mkfifo("./myfifo", 0777);</li>
</ol>
<p>
with mkfifo creat a file, so that other unrelated process can commu  
</p>

<ol class="org-ol">
<li>In one process : fd = open("./myfifo", O<sub>WRONGLY</sub>);</li>
</ol>
<p>
open the file,  and :
write(fd, &amp;process<sub>inter,1</sub>);
change the pipe variable.
</p>

<ol class="org-ol">
<li>In other process :   fd = open("./myfifo",O<sub>RDONLY</sub>);</li>
</ol>
<p>
open the file, and : while(process<sub>inter</sub> == 0);
can be controled by pipe variable 
</p>
</div>
</div>

<div id="outline-container-org1389adc" class="outline-3">
<h3 id="org1389adc">unnamed pipe</h3>
<div class="outline-text-3" id="text-org1389adc">
<ol class="org-ol">
<li><p>
In one process diff threads
creat place for pipe : int fd[2]; one for main thread, one for new thread
creat pipe : int ret = pipe(fd);
</p>

<p>
in new thread : read(fd[0], &amp;process<sub>inter</sub> 1); if nothing to read, sleep
in main thread do its stuff, 
after finish : write(fd[1], &amp;process<sub>inter</sub>, 1); let new pthread run
</p>

<p>
remeber: wirte at frist in fd[1], and then read at fd[0]
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orga0b6c0a" class="outline-3">
<h3 id="orga0b6c0a">memcpy</h3>
<div class="outline-text-3" id="text-orga0b6c0a">
<p>
memcpy(p, "niao",4);
</p>
</div>
</div>

<div id="outline-container-org2527a6d" class="outline-3">
<h3 id="org2527a6d">kill</h3>
<div class="outline-text-3" id="text-org2527a6d">
<p>
kill(pid, 9);
send signal 9 to pid process
</p>
</div>
</div>

<div id="outline-container-org4940ca5" class="outline-3">
<h3 id="org4940ca5">raise</h3>
<div class="outline-text-3" id="text-org4940ca5">
<p>
raise(9);  == kill(getpid(), 9);
</p>
</div>
</div>

<div id="outline-container-orgf01a93a" class="outline-3">
<h3 id="orgf01a93a">alarm</h3>
<div class="outline-text-3" id="text-orgf01a93a">
<p>
alarm(10);   wait for 10 seconds and kill itself
send signal as 14 to itself
</p>
</div>
</div>

<div id="outline-container-org24fa24d" class="outline-3">
<h3 id="org24fa24d">pause</h3>
<div class="outline-text-3" id="text-org24fa24d">
<p>
pause(); stoped for ever
</p>
</div>
</div>

<div id="outline-container-orgec4fa8c" class="outline-3">
<h3 id="orgec4fa8c">signal</h3>
<div class="outline-text-3" id="text-orgec4fa8c">
<p>
signal(signal<sub>ID</sub>, self<sub>function</sub>); self function or SIG<sub>ING</sub> or SIG<sub>DFL</sub>
</p>
</div>
</div>
