linux.org
** key

key can be 2 differ
#+BEGIN_SRC 

1. For father and son process : IPC_PRIVATE : 
2. For unrelated process : self_def key
  int key;
  key = ftok("./a.c", 'a');
  if (key < 0) {
    printf("create key for server failed \n");
    return -1;
  }
  printf("create key for server success \n");

#+END_SRC

** shmget

  shmid = shmget(IPC_PRIVATE, 128, 0777);
  shmid = shmget(key, 128, IPC_CREAT | 0777);

** shmat

char *p  = (char *) shmat(shmid, NULL, 0);
after mapping to p : can be manipulated
scanf("%s", p);
printf("%s", p);

** shmdt

delete the mapping of p to shared memory 
shmdt(p); 
after that, the manipulation of p is not allowed, and well be
segmention fault

** shmctl

delete the created shared memory
shmctl(shmid, IPC_RMID, NULL); == iprcm -m shmid

** IPC manipulation

show : ipcs -m(shared memory) -q(message queue) -s(semaphores) 
delete : ipcrm -m shmid /-q msgid /-s semid

** msgget

msgid= msgget(IPC_PRIVATE, 0777);

** msgctl

msgctl(msgid, IPC_RMID, NULL); == ipcrm -q msgid

** msgsnd

msgsnd(msgid, (void *)&sendbuffer, strlen(sendbuffer.message), 0);

** msgrcv

receivelen = msgrcv(msgid, (void *)&receiverbuffer, messagelen, 100, 0);

** semget

semid = semget(IPC_PRIVATE,3 ,  0777);

** semctl

semctl(semid, 0, IPC_RMID, NULL);

* Git
** tips
Raw 文件
** Git installation in Linux
#+BEGIN_SRC 
1. sudo apt install git

2. local configuration
#+begin_src sh
   git  config --global user.name "username1"
   git  config --global user.email "email1"
#+end_src
   git  config --list

3. in local terminal
#+begin_src sh
   ssh-keygen -t rsa -C "email2"
#+end_src
and then just all enter as default
   warming: email1 == email2

#+END_SRC
** Webconfig
#+BEGIN_SRC 
1. go to Fold Docu1, and in terminal git init to create local  repository
2. apply github count with:
   Email: email3
   Username: username3
   Password:xxxx
3. in setting add ssh key from local document: ./ssh/id_rsa.pub
4. create web repository with name Docu2
   Warming: Docu1 == Docu2
#+END_SRC
** Connection
#+BEGIN_SRC 

1. in local computer Docu1, create our files and prepare to push to
   Github
2. git add && git commit -m ""
3. git remote add origin HTTPS/SSH(of the created web repository)
   warming: with  HTTPS will be ask the Username:username3 and
   password:xxxx every time for the push, but SSH note
4. git push -u origin master
5. username3 and xxxx if necessary
6. later push it only use git push origin master
#+END_SRC
** Magit Commit "C-x g" in E** Github on Windows
#+BEGIN_SRC 
1.  download git(scm) for windows
2. copy package to somewhere to install
3. choose the install path and editor
4. create a NEW Repository and copy its ADDRESS
create a file, .ssh and
ssh-keygen -t rsa -C "your_email@example.com"
and the id_rsa.pub into Github(New SSH key)
5. to Desktop, git init
6. create file, git add, git commit
7. git remote and NAMe ADDRESS
8. git push NAMe master
#+END_SRC
** Merge with aother branch

#+BEGIN_SRC 
after pull, git checkout dev
git push -u name dev 

#+END_SRC
** Gitcommond
*** 创建mybranch分支

git branch mybrauch
git checkout mybrauch
create .gitignore
git add -A
git reset xxx.tex
git status
git commit -m "commit"
git add -A 
git commit -m "mybrauch"
git push -u origin mybrauch

*** merge mybranch分支到master分支
git checkout master
git pull origin master
git branch --merged
git merge mybrauch
git push origin master

*** 删除mybranch分支
git branch --merged
git branch -d mybrauch
git branch -a 
git push origin --delete mybrauch

** commands

add 添加索引  

编辑当前文件后，想恢复，且未添加索引(未 add) ：  git checkout --file
编辑当前文件后，想恢复，但已添加索引(已 add) ：  git reset HEAD file 再 git checkout --file
编辑当前文件后，想查变动，且未添加索引(未 add) ： git diff
编辑当前文件后，想查变动，但已添加索引(已 add) ： git diff --cached
编辑当前文件后，已提交(已 add),想撤出索引 ：    git rm --cached  file

编辑后，强制回到最近一次添加索引的版本：        git reset --hard HEAD
编辑后，强制回到最近倒数第二次添加索引的版本：   git reset --hard HEAD~
编辑后，强制回到最近倒数第n次添加索引的版本：    git reset --hard HEAD~n

如果将HEAD换成对应的ID， 也可以回到之前相应的版本。 但是如果想再回去，
又没有记住之前的ID， 可以用，       git reflog 查询.



commit 添加提交
和上次commit提交融合，不产生新的提交记录：  git commit --amend


branch 新分支
创建新的分支： git branch development
带着全部家当去新的分支： git checkout development

merge 融合分支
如果此时只有development分支改变，可以直接回到master, 把development分支
merge 过来   git merge development


** Magit
#+BEGIN_SRC 
C-x g  : open the git buffer
S or s : to stage
C      : to commit 
C-c C-c : to finish commit
P and p to push
#+END_SRC
** github conflict with local git
#+BEGIN_SRC 
delete from github
1. delete in github seit
2. git pull origin master
3. edit anyhow and push
#+END_SRC

#+BEGIN_SRC 
delete from local git
git rm -r  target
git add *
git commit -m "commit"
git push origin master

#+END_SRC

** new system merge
#+BEGIN_SRC 
sudo apt install git
config 3646
add ssh-key
git clone
git push

#+END_SRC

