linux.html

<div id="outline-container-orgd3f2d87" class="outline-3">
<h3 id="orgd3f2d87">key</h3>
<div class="outline-text-3" id="text-orgd3f2d87">
<p>
key can be 2 differ
</p>
<pre class="example">

1. For father and son process : IPC_PRIVATE : 
2. For unrelated process : self_def key
  int key;
  key = ftok("./a.c", 'a');
  if (key &lt; 0) {
    printf("create key for server failed \n");
    return -1;
  }
  printf("create key for server success \n");

</pre>
</div>
</div>

<div id="outline-container-org56a77a8" class="outline-3">
<h3 id="org56a77a8">shmget</h3>
<div class="outline-text-3" id="text-org56a77a8">
<p>
shmid = shmget(IPC<sub>PRIVATE</sub>, 128, 0777);
shmid = shmget(key, 128, IPC<sub>CREAT</sub> | 0777);
</p>
</div>
</div>

<div id="outline-container-orgc7d6fbc" class="outline-3">
<h3 id="orgc7d6fbc">shmat</h3>
<div class="outline-text-3" id="text-orgc7d6fbc">
<p>
char *p  = (char *) shmat(shmid, NULL, 0);
after mapping to p : can be manipulated
scanf("%s", p);
printf("%s", p);
</p>
</div>
</div>

<div id="outline-container-org51109ce" class="outline-3">
<h3 id="org51109ce">shmdt</h3>
<div class="outline-text-3" id="text-org51109ce">
<p>
delete the mapping of p to shared memory 
shmdt(p); 
after that, the manipulation of p is not allowed, and well be
segmention fault
</p>
</div>
</div>

<div id="outline-container-orgd19c9b8" class="outline-3">
<h3 id="orgd19c9b8">shmctl</h3>
<div class="outline-text-3" id="text-orgd19c9b8">
<p>
delete the created shared memory
shmctl(shmid, IPC<sub>RMID</sub>, NULL); == iprcm -m shmid
</p>
</div>
</div>

<div id="outline-container-org1fa6cf5" class="outline-3">
<h3 id="org1fa6cf5">IPC manipulation</h3>
<div class="outline-text-3" id="text-org1fa6cf5">
<p>
show : ipcs -m(shared memory) -q(message queue) -s(semaphores) 
delete : ipcrm -m shmid /-q msgid /-s semid
</p>
</div>
</div>

<div id="outline-container-orgf5f53b8" class="outline-3">
<h3 id="orgf5f53b8">msgget</h3>
<div class="outline-text-3" id="text-orgf5f53b8">
<p>
msgid= msgget(IPC<sub>PRIVATE</sub>, 0777);
</p>
</div>
</div>

<div id="outline-container-orgfbb08ea" class="outline-3">
<h3 id="orgfbb08ea">msgctl</h3>
<div class="outline-text-3" id="text-orgfbb08ea">
<p>
msgctl(msgid, IPC<sub>RMID</sub>, NULL); == ipcrm -q msgid
</p>
</div>
</div>

<div id="outline-container-org410f9cd" class="outline-3">
<h3 id="org410f9cd">msgsnd</h3>
<div class="outline-text-3" id="text-org410f9cd">
<p>
msgsnd(msgid, (void *)&amp;sendbuffer, strlen(sendbuffer.message), 0);
</p>
</div>
</div>

<div id="outline-container-orgd2425e3" class="outline-3">
<h3 id="orgd2425e3">msgrcv</h3>
<div class="outline-text-3" id="text-orgd2425e3">
<p>
receivelen = msgrcv(msgid, (void *)&amp;receiverbuffer, messagelen, 100, 0);
</p>
</div>
</div>

<div id="outline-container-org73ca6ea" class="outline-3">
<h3 id="org73ca6ea">semget</h3>
<div class="outline-text-3" id="text-org73ca6ea">
<p>
semid = semget(IPC<sub>PRIVATE,3</sub> ,  0777);
</p>
</div>
</div>

<div id="outline-container-orgb56c693" class="outline-3">
<h3 id="orgb56c693">semctl</h3>
<div class="outline-text-3" id="text-orgb56c693">
<p>
semctl(semid, 0, IPC<sub>RMID</sub>, NULL);
</p>
</div>
</div>
</div>

<div id="outline-container-org32c870d" class="outline-2">
<h2 id="org32c870d">Git</h2>
<div class="outline-text-2" id="text-org32c870d">
</div>
<div id="outline-container-orga1c6310" class="outline-3">
<h3 id="orga1c6310">tips</h3>
<div class="outline-text-3" id="text-orga1c6310">
<p>
Raw 文件
</p>
</div>
</div>
<div id="outline-container-org175473f" class="outline-3">
<h3 id="org175473f">Git installation in Linux</h3>
<div class="outline-text-3" id="text-org175473f">
<pre class="example">
1. sudo apt install git

2. local configuration
#+begin_src sh
   git  config --global user.name "username1"
   git  config --global user.email "email1"
</pre>
<p>
git  config &#x2013;list
</p>

<ol class="org-ol">
<li>in local terminal</li>
</ol>
<div class="org-src-container">
<pre class="src src-sh">ssh-keygen -t rsa -C <span style="color: #2d9574;">"email2"</span>
</pre>
</div>
<p>
and then just all enter as default
   warming: email1 == email2
</p>

<p>
#+END<sub>SRC</sub>
</p>
</div>
</div>
<div id="outline-container-orgc645c81" class="outline-3">
<h3 id="orgc645c81">Webconfig</h3>
<div class="outline-text-3" id="text-orgc645c81">
<pre class="example">
1. go to Fold Docu1, and in terminal git init to create local  repository
2. apply github count with:
   Email: email3
   Username: username3
   Password:xxxx
3. in setting add ssh key from local document: ./ssh/id_rsa.pub
4. create web repository with name Docu2
   Warming: Docu1 == Docu2
</pre>
</div>
</div>
<div id="outline-container-org5eee56e" class="outline-3">
<h3 id="org5eee56e">Connection</h3>
<div class="outline-text-3" id="text-org5eee56e">
<pre class="example">

1. in local computer Docu1, create our files and prepare to push to
   Github
2. git add &amp;&amp; git commit -m ""
3. git remote add origin HTTPS/SSH(of the created web repository)
   warming: with  HTTPS will be ask the Username:username3 and
   password:xxxx every time for the push, but SSH note
4. git push -u origin master
5. username3 and xxxx if necessary
6. later push it only use git push origin master
</pre>
</div>
</div>
<div id="outline-container-org9a6b00d" class="outline-3">
<h3 id="org9a6b00d">Magit Commit "C-x g" in E** Github on Windows</h3>
<div class="outline-text-3" id="text-org9a6b00d">
<pre class="example">
1.  download git(scm) for windows
2. copy package to somewhere to install
3. choose the install path and editor
4. create a NEW Repository and copy its ADDRESS
create a file, .ssh and
ssh-keygen -t rsa -C "your_email@example.com"
and the id_rsa.pub into Github(New SSH key)
5. to Desktop, git init
6. create file, git add, git commit
7. git remote and NAMe ADDRESS
8. git push NAMe master
</pre>
</div>
</div>
<div id="outline-container-org120effb" class="outline-3">
<h3 id="org120effb">Merge with aother branch</h3>
<div class="outline-text-3" id="text-org120effb">
<pre class="example">
after pull, git checkout dev
git push -u name dev 

</pre>
</div>
</div>
<div id="outline-container-org317f970" class="outline-3">
<h3 id="org317f970">Gitcommond</h3>
<div class="outline-text-3" id="text-org317f970">
</div>
<div id="outline-container-org6d850c9" class="outline-4">
<h4 id="org6d850c9">创建mybranch分支</h4>
<div class="outline-text-4" id="text-org6d850c9">
<p>
git branch mybrauch
git checkout mybrauch
create .gitignore
git add -A
git reset xxx.tex
git status
git commit -m "commit"
git add -A 
git commit -m "mybrauch"
git push -u origin mybrauch
</p>
</div>
</div>

<div id="outline-container-org5be2431" class="outline-4">
<h4 id="org5be2431">merge mybranch分支到master分支</h4>
<div class="outline-text-4" id="text-org5be2431">
<p>
git checkout master
git pull origin master
git branch &#x2013;merged
git merge mybrauch
git push origin master
</p>
</div>
</div>

<div id="outline-container-org061aab6" class="outline-4">
<h4 id="org061aab6">删除mybranch分支</h4>
<div class="outline-text-4" id="text-org061aab6">
<p>
git branch &#x2013;merged
git branch -d mybrauch
git branch -a 
git push origin &#x2013;delete mybrauch
</p>
</div>
</div>
</div>

<div id="outline-container-org2982ba2" class="outline-3">
<h3 id="org2982ba2">commands</h3>
<div class="outline-text-3" id="text-org2982ba2">
<p>
add 添加索引  
</p>

<p>
编辑当前文件后，想恢复，且未添加索引(未 add) ：  git checkout &#x2013;file
编辑当前文件后，想恢复，但已添加索引(已 add) ：  git reset HEAD file 再 git checkout &#x2013;file
编辑当前文件后，想查变动，且未添加索引(未 add) ： git diff
编辑当前文件后，想查变动，但已添加索引(已 add) ： git diff &#x2013;cached
编辑当前文件后，已提交(已 add),想撤出索引 ：    git rm &#x2013;cached  file
</p>

<p>
编辑后，强制回到最近一次添加索引的版本：        git reset &#x2013;hard HEAD
编辑后，强制回到最近倒数第二次添加索引的版本：   git reset &#x2013;hard HEAD~
编辑后，强制回到最近倒数第n次添加索引的版本：    git reset &#x2013;hard HEAD~n
</p>

<p>
如果将HEAD换成对应的ID， 也可以回到之前相应的版本。 但是如果想再回去，
又没有记住之前的ID， 可以用，       git reflog 查询.
</p>



<p>
commit 添加提交
和上次commit提交融合，不产生新的提交记录：  git commit &#x2013;amend
</p>


<p>
branch 新分支
创建新的分支： git branch development
带着全部家当去新的分支： git checkout development
</p>

<p>
merge 融合分支
如果此时只有development分支改变，可以直接回到master, 把development分支
merge 过来   git merge development
</p>
</div>
</div>


<div id="outline-container-org4be9a5c" class="outline-3">
<h3 id="org4be9a5c">Magit</h3>
<div class="outline-text-3" id="text-org4be9a5c">
<pre class="example">
C-x g  : open the git buffer
S or s : to stage
C      : to commit 
C-c C-c : to finish commit
P and p to push
</pre>
</div>
</div>
<div id="outline-container-orgd2546a0" class="outline-3">
<h3 id="orgd2546a0">github conflict with local git</h3>
<div class="outline-text-3" id="text-orgd2546a0">
<pre class="example">
delete from github
1. delete in github seit
2. git pull origin master
3. edit anyhow and push
</pre>

<pre class="example">
delete from local git
git rm -r  target
git add *
git commit -m "commit"
git push origin master

</pre>
</div>
</div>

<div id="outline-container-org6ff4f67" class="outline-3">
<h3 id="org6ff4f67">new system merge</h3>
<div class="outline-text-3" id="text-org6ff4f67">
<pre class="example">
sudo apt install git
config 3646
add ssh-key
git clone
git push

</pre>
</div>
</div>
</div>
